{"pages":[{"title":"A privacy-focused loyalty network for customers and businesses","text":"What is this? Discount Network is a unique concept that enables companies to offer a privacy-focused savings network for customers and businesses. SaaS monetization It's a business-in-a-box solution to give small and medium businesses without any app or hardware requirements a savings opportunity. The starting point is that both customers and businesses can use the system free of charge. If companies want to change the standard rules or add staff, they have to buy a premium account. Privacy-focused Businesses do not have access to customers' personal data. This can seem counterproductive for marketing purposes, but it's the most responsible thing to do for customers. We have given this a lot of thought and although the product is still at an early stage, there are too many complications when handing over personal data such as names and email addresses to companies that have not been verified. Case law on personal data is growing and it is everyone's responsibility to handle it with care. And it is a great selling point at the same time. What is the target group? We strongly advise you to only buy this script if you understand what you are buying. Technical knowledge is required. We sell a lot of experience and time for a low price, which means that support is limited to bugs. Make sure you understand the hosting requirements. You get the full source code, so you can modify every part of it. No technical consultancy is included in the price, but customization for companies is possible on the basis of a project agreement. User Manual Website Customers Businesses Admin dashboard Technical Manual Hosting requirements Install the script How to update Technology stack Customizations Updates &amp; Questions Changelog FAQ","tags":"","url":"index.html"},{"title":"Getting Started","text":"A privacy-focused customer loyalty network. Discount Network is a PHP\/MySQL script that you can install on a compliant hosting. You keep control of your information and have control over data and costs. The script has no restrictions regarding the number of users, or anything else. User manual Website Customers Businesses Admin dashboard Technical manual Hosting requirements Install the script How to update Technology stack Customizations Updates and FAQ Changelog Frequently Asked Questions","tags":"","url":"Getting_Started.html"},{"title":"Homepage","text":"On the homepage three tabs are visible that briefly explain what is possible with the system. If no user is logged in, the buttons refer to the registration. When a user is logged in, the buttons change depending on the user role. Related Add or update social links in footer Change textual content Multi-language \/ translations Change background image","tags":"","url":"Website\/Homepage.html"},{"title":"About","text":"The &quot;About&quot; page explains what is possible for each target group; customers and businesses. Related Add or update social links in footer Change textual content Multi-language \/ translations Change background image","tags":"","url":"Website\/About.html"},{"title":"Sign up","text":"The registration page has two tabs. By default, the customer registration tab is opened. If a user wants to register as a business, he must open the &quot;Business&quot; tab. Related Add or update social links in footer Change textual content Multi-language \/ translations Change background image","tags":"","url":"Website\/Sign_up.html"},{"title":"Log in","text":"All users can login to the same page. The &quot;Forgot password?&quot; tab allows users to reset their lost password. Related Add or update social links in footer Change textual content Multi-language \/ translations Change background image","tags":"","url":"Website\/Log_in.html"},{"title":"Earn points","text":"Each customer has a customer number and personal QR code that they can give to a business to earn points. This is a fixed number and QR code. So you can print this code on a loyalty card for example to easily assing points to a customer. Related How a business issues points for a customer How a business calculates the points to be awarded Change textual content Multi-language \/ translations Change background image","tags":"","url":"Customers\/Earn_points.html"},{"title":"Wallet","text":"In the screenshot above you can see what a wallet can look like when savings are made - in this case - at 3 different businesses. Below is a savings card with all the details and scenarios: Points have expired Points have been used Points have been partially used Points have not yet been used A discount has been given When a customer has earned enough points from a company for a discount, a &quot;Discount&quot; button will be visible on the card. When a customer clicks this button, the following dialog appears: After entering the discount amount desired by the customer, the &quot;Get code&quot; button will show this dialog box: The 4-digit code can be given to the business. The business can then exchange the points for a discount. Related How a business redeems a customer's points Change textual content Multi-language \/ translations Change background image","tags":"","url":"Customers\/Wallet.html"},{"title":"User profile","text":"Users can update their personal information using the &quot;Profile&quot; settings. On the &quot;Localization&quot; tab the locale and time zone can be set. The locale determines how numbers and dates are displayed, and the time zone ensures that times are displayed correctly. If the user wants to change his or her password, this can be done at the &quot;Password&quot; tab. Related Change textual content Multi-language \/ translations","tags":"","url":"Customers\/User_profile.html"},{"title":"Issue points","text":"A business can assign points to customers using a customer number. If a customer number has been entered, click &quot;Verify&quot; and a dialog box opens in which the sales amount can be entered. The number of points awarded is calculated according to the rules set by the business. After the points have been awarded, the transaction is added. On Android and iOS devices, a QR icon is visible in the input. Clicking this button opens the camera and allows you to take a picture of a customer's QR code. Related How to get a customer number How to set the rules for the points to be awarded How to view all awarded points Change textual content Multi-language \/ translations Change background image","tags":"","url":"Businesses\/Issue_points.html"},{"title":"Redeem points","text":"A business can redeem points to customers using a discount code generated by a customer. If a discount code has been entered, click &quot;Verify&quot; and a dialog with the value of the code will be shown. Click &quot;Redeem points&quot; to credit the points from the customer's account. Once the points have been redeemed, it is up to the business to process the discount. All discounts are shown in the transaction overview. On Android and iOS devices, a QR icon is visible in the input. Clicking this button opens the camera and allows you to take a picture of a customer's QR code. Related How to get a discount code How to view all redeemed points Change textual content Multi-language \/ translations Change background image","tags":"","url":"Businesses\/Redeem_points.html"},{"title":"Transactions","text":"The transaction overview shows all points issued and redeemed. When the business user is logged in, all transactions are visible. If a staff member is logged in, only the transactions of that staff member are visible. Related How to add staff Change textual content Multi-language \/ translations Change background image","tags":"","url":"Businesses\/Transactions.html"},{"title":"Staff","text":"A staff member can login to his own account and add and redeem points on behalf of a business. They have insight into their own transactions, only the business account can see all transactions. If a business upgrades to a premium account, they can add staff members. Related How to get a premium subscription Configure payment gateway Change textual content Multi-language \/ translations Change background image","tags":"","url":"Businesses\/Staff.html"},{"title":"Rules","text":"With a free account, businesses must use the standard rules. The &quot;Test calculator&quot; can be used to calculate how much a customer can earn and needs for a discount. If a business upgrades to a premium account, they are allowed to change the rules. Related How to get a premium subscription Change the default rules Configure payment gateway Change textual content Multi-language \/ translations Change background image","tags":"","url":"Businesses\/Rules.html"},{"title":"User profile","text":"Users can update their personal information using the &quot;Profile&quot; settings. On the &quot;Localization&quot; tab the locale and time zone can be set. The locale determines how numbers and dates are displayed, and the time zone ensures that times are displayed correctly. If the user wants to change his or her password, this can be done at the &quot;Password&quot; tab. Related Change textual content Multi-language \/ translations","tags":"","url":"Businesses\/User_profile.html"},{"title":"Business settings","text":"In the business settings you can set how a company is shown in a customer's wallet. A cover image (optional), name (required) and a short description (optional). On the &quot;Localization&quot; tab the currency can be updated. Be careful to change the currency if there are already customers who have earned points. When the currency is changed, it will also be changed in the customer's wallet. Related Change textual content Multi-language \/ translations","tags":"","url":"Businesses\/Business_settings.html"},{"title":"Subscription","text":"By default, the &quot;manual&quot; payment gateway is set. If Stripe is configured, the flow is as follows: Related Configure payment gateway Change textual content Multi-language \/ translations","tags":"","url":"Businesses\/Subscription.html"},{"title":"Dashboard","text":"The admin user has an overview of all accounts, and can export and access these accounts. The dashboard shows an overview of all options: Users - User management where you can log in to accounts and export all accounts. Profile - Update email address, password and localization details. View your current version, learn how to update here. Related Change textual content Multi-language \/ translations Change background image","tags":"","url":"Admin_dashboard\/Dashboard.html"},{"title":"Users","text":"Admins can edit, delete and export users here. It's also possible to log in to any account. Premium When editing a user, there is a Premium option. A expiration date can be set for a premium subscription. Related Change textual content Multi-language \/ translations Change background image","tags":"","url":"Admin_dashboard\/Users.html"},{"title":"User profile","text":"Here the admin can update personal information. On the &quot;Localization&quot; tab the locale and time zone can be set. The locale determines how numbers and dates are displayed, and the time zone ensures that times are displayed correctly. If the user wants to change his or her password, this can be done at the &quot;Password&quot; tab. Related Change textual content Multi-language \/ translations Change background image","tags":"","url":"Admin_dashboard\/User_profile.html"},{"title":"Hosting requirements","text":"Requirements Make sure your MySQL version is higher or equal to 5.7.8. MySQL &gt;= 5.7.8 (or MariaDB &gt;= 10.2.7) Apache &gt;= 2.4 PHP 7.2 or 7.3 (7.4 will not work) BCMath PHP Extension Ctype PHP Extension JSON PHP Extension Mbstring PHP Extension OpenSSL PHP Extension PDO PHP Extension Tokenizer PHP Extension XML PHP Extension","tags":"","url":"Technical_Documentation\/Installation\/Hosting_requirements.html"},{"title":"Technology stack","text":"Technologies The back-end is built with the Laravel 6 PHP framework and MySQL is used for the database. The front-end uses the Vuetify 2 framework based on Vue. Styles (CSS) and JavaScript are managed and compiled with Node Package Manager. The front-end Vue files are located in the resources\/frontend directory. Full source included All source files are included. There is no manual how to create new features, but since Laravel is used for the back-end and Vuetify for the front-end, you can study these frameworks to get a good understanding. Technical help with features or server related configurations is beyond the scope of this script. There is a lot of information available on the internet on how work with these frameworks. Libraries used All PHP libraries that have been used can be found in the composer.json file in the root of the project, and all JavaScript libraries are listed in the resources\/frontend\/package.json file.","tags":"","url":"Technical_Documentation\/Installation\/Technology_stack.html"},{"title":"Install the script","text":"Installation Download Zip If you open the downloaded zip, you will see a directory structure as below: \\---productinnovation-loyalty-discount-[commit_hash] +---docs +---htdocs \\---updates The application files are in the htdocs directory. Upload the files in this directory to the webroot of your hosting account. The script must be installed on a top level domain or subdomain. For instance example.com or sub.example.com. Sub-directories like example.com\/loyalty are not supported. If you want to test on your localhost you have to create a host file entry like loyalty.test. It will not work on urls like 127.0.0.0\/loyalty. Install script Open the url where you have installed the script. You should see a screen as follows: Follow the installation steps and the script will be installed in the last step. Troubleshooting Logs If you run into a 500 or other error, check the logs in storage\/logs. Send us a support message if you are not sure what the logs mean. Reinstall If you want to reinstall the script, just remove the .env file from the webroot. Make sure the .env.example file exists, do not rename it, it will be copied during the installation.","tags":"","url":"Technical_Documentation\/Installation\/Install_the_script.html"},{"title":"How to update","text":"Find your current version Download Zip Extract files No need to update at first installation Find your current version When you log in as admin, you will see the version number on the dashboard. Download Zip In the latest zip file you download there is an updates directory: \\---productinnovation-loyalty-discount-[commit_hash] +---docs +---htdocs \\---updates incremental-update-x.x.x.zip Extract files The file incremental-update-x.x.x.zip contains all updated files, so you do not have to worry about your current version. You can simply overwrite the files of your installation with the update files, it doesn't matter which version the Zip or your installation has. The incremental-update-x.x.x.zip file contains a htdocs directory. Extract the files in that directory to the root directory of your installation. No need to update at first installation The contents of the Zip file you download always has the latest version in the htdocs directory. You do not need to update if you install the script for the first time. Only if you have already installed the script and want to update to a newer version.","tags":"","url":"Technical_Documentation\/Installation\/How_to_update.html"},{"title":"Social links","text":"In the footer there is a &quot;Connect&quot; head with social icons. This is only visible if at least one social media link has been configured. In the .env file in the web root you will find the configuration below: # Social links in footer # --- # Enter the full url to your social account # (e.g. https:\/\/twitter.com\/NowSquareCom) SOCIAL_TWITTER=&quot;&quot; SOCIAL_YOUTUBE=&quot;&quot; SOCIAL_FACEBOOK=&quot;&quot; SOCIAL_INSTAGRAM=&quot;&quot; SOCIAL_MEDIUM=&quot;&quot; SOCIAL_SNAPCHAT=&quot;&quot; SOCIAL_LINKEDIN=&quot;&quot; SOCIAL_GITHUB=&quot;&quot;","tags":"","url":"Technical_Documentation\/Configuration\/Social_links.html"},{"title":"Rules","text":"In the .env file in the web root you will find the configuration below: # Default rules DEFAULT_POINTS_EXPIRATION_MONTHS=&quot;&quot; DEFAULT_POINTS_PER_CURRENCY=&quot;&quot; DEFAULT_POINT_VALUE=&quot;&quot; DEFAULT_MIN_POINTS_PER_PURCHASE=&quot;&quot; DEFAULT_MAX_POINTS_PER_PURCHASE=&quot;&quot; DEFAULT_MIN_POINTS_PER_REDEMPTION=&quot;&quot; DEFAULT_MAX_POINTS_PER_REDEMPTION=&quot;&quot; Update the values as you want. These are the default values: # Default rules DEFAULT_POINTS_EXPIRATION_MONTHS=6 DEFAULT_POINTS_PER_CURRENCY=200 DEFAULT_POINT_VALUE=0.0001 DEFAULT_MIN_POINTS_PER_PURCHASE=100 DEFAULT_MAX_POINTS_PER_PURCHASE=1000000 DEFAULT_MIN_POINTS_PER_REDEMPTION=15000 DEFAULT_MAX_POINTS_PER_REDEMPTION=500000","tags":"","url":"Technical_Documentation\/Configuration\/Rules.html"},{"title":"Payment gateway","text":"Manual By default, the &quot;manual&quot; payment gateway is set. This will show a message that a user should send an email to the public email address. The admin can change the premium expiration date in the user admin. Pricing The pricing can be configured in the .env file in the web root: # Premium pricing PREMIUM_PRICE_MONTHLY=&quot;&quot; PREMIUM_PRICE_YEARLY=&quot;&quot; PREMIUM_PRICE_CURRENCY=&quot;&quot; The default values are: # Premium pricing PREMIUM_PRICE_MONTHLY=39 PREMIUM_PRICE_YEARLY=399 PREMIUM_PRICE_CURRENCY=&quot;USD&quot; Configure Stripe Gateway To configure Stripe, open the .env file in the web root and set the PAYMENT_GATEWAY to &quot;stripe&quot;. Follow the steps below to configure the other settings. PAYMENT_GATEWAY=&quot;stripe&quot; API keys On the Stripe dashboard, go to Developers &gt; API keys. Here you will find the publishable and secret keys. # Developers &gt; API keys &gt; Publishable key STRIPE_PUBLIC_KEY=&quot;&quot; # Developers &gt; API keys &gt; Secret key STRIPE_SECRET_KEY=&quot;&quot; Webhook Now go to Developers &gt; Webhooks and click &quot;Add endpoint&quot;. Your endpoint is the domain where you installed the script with the addition \/api\/webhooks\/stripe. For example https:\/\/example.com\/api\/webhooks\/stripe. At &quot;Events to send&quot; select the following items: customer.deleted invoice.payment_succeeded customer.subscription.updated Add products You have to add two products, one with monthly billing for the montly subscription, and one with annual billing for the yearly subscription. Go to Products and click &quot;Add a product&quot;. Enter a &quot;Name&quot; and &quot;Price&quot;. Leave &quot;Standard pricing&quot; and &quot;Recurring&quot;, and don't add a trial period. Click &quot;Save product&quot;, now the product details will be shown as below. Copy the API ID. This starts with price_ and looks like price_1Gz2U9FClLTitVS9B01ZH1xT. Enter the &quot;price_xxxxxxxx&quot; ids in the .env file. STRIPE_PLAN_ID_MONTHLY=&quot;&quot; STRIPE_PLAN_ID_YEARLY=&quot;&quot;","tags":"","url":"Technical_Documentation\/Configuration\/Payment_gateway.html"},{"title":"Email","text":"In the .env file in the web root you will find the email related configuration: # Supported drivers: &quot;sendmail&quot;, &quot;smtp&quot; and &quot;mailgun&quot; # https:\/\/laravel.com\/docs\/6.x\/mail # For simple and reliable email we recommend https:\/\/sendgrid.com\/ # When using sendgrid, use MAIL_DRIVER=smtp MAIL_DRIVER=sendmail MAIL_HOST=smtp.sendgrid.net MAIL_PORT=465 MAIL_ENCRYPTION=ssl MAIL_USERNAME=apikey MAIL_PASSWORD=null # Only when using Mailgun # The values can be api.mailgun.net, api.eu.mailgun.net or api.us.mailgun.net # depending on the region you selected in the Mailgun dashboard. MAILGUN_ENDPOINT=api.mailgun.net MAILGUN_DOMAIN=mg.mymailgundomain.com MAILGUN_SECRET=","tags":"","url":"Technical_Documentation\/Configuration\/Email.html"},{"title":"Content","text":"Update content The website content can be found in the resources\/lang\/en\/app.php file. You can change any text related string in this file. Email related content can be found in resources\/lang\/en\/mail.php. Some content consists of arrays: &quot;contact_paragraphs&quot; =&gt; [ &quot;If you want more information or have any questions, please send an email to :app_contact_email.&quot;, &quot;We'll get back to you ASAP.&quot; ], Arrays allow you to add or remove items. Use a language other than English See Translations.","tags":"","url":"Technical_Documentation\/Customization\/Content.html"},{"title":"Translations","text":"Default language If more than one language is available, the app chooses the default language for a visitor based on his or her browser. Use a language other than English The default language is English, if you want to use another language, please adjust the following. Copy language file Copy resources\/lang\/en\/app.php and resources\/lang\/en\/mail.php to resources\/lang\/[two-letter language code]\/. Where [two-letter language code] is the language you want to add. And update the files accordingly. Update configuration Open the .env file in the webroot, and change the DEFAULT_LANGUAGE to the language you want to use. For example: DEFAULT_LANGUAGE=&quot;de&quot; Use multiple languages If there is more than one language directory (resources\/lang\/[two-letter language code]\/), a language drop-down will be displayed to change the language. If you want to disable a language, you have to prefix the directory name with an underscore. For example resources\/lang\/_en\/.","tags":"","url":"Technical_Documentation\/Customization\/Translations.html"},{"title":"Background images","text":"I just love these background pictures, but how can I customize them? All background images can be found in the folder public\/img.","tags":"","url":"Technical_Documentation\/Customization\/Background_images.html"},{"title":"Changelog","text":"Information on how to update can be found here. Version 1.1.6 - Nov 11 2021 Fixed issue where partially redeemed points were not split correctly over multiple purchases Version 1.1.5 - Nov 9 2021 Fixed issue where points were not deducted if a transaction was partially redeemed already Version 1.1.4 - Jan 1 2021 Added development .env for Vue Version 1.1.3 - Aug 4 2020 Automatically adjust QR code to device screen size Removed non-working copy to clipboard due to Vue reactivity flow Version 1.1.2 - Jun 29 2020 Updated issue due to Stripe changes Updated docs Admin dashboard button color update Version 1.1.1 - Mar 2 2020 Fixed side drawer buttons not working on Safari Updated wrong profile link on admin dashboard Switched sign up button to user icon on small devices Three states for max-width title and logo to fit on small devices Added white border to QR codes in dark scheme because inverted QR codes don't work with scanner script Version 1.1.0 - Feb 27 2020 Added QR scanner button on Android and iOS devices to scan customer numbers and discount codes Fine tuned responsive title behavior to improve layout on small devices Resolved PHP 7.4 type offset issue DataForm show friendly error in case msg is empty Translation file updates Doc updates Version 1.0.0 - Feb 19 2020 Initial release","tags":"","url":"Updates_and_Changes\/Changelog.html"},{"title":"Frequently Asked Questions","text":"How can I see which version I have? How can I see what is the latest version? How can I change the content? How can I add or modify languages? What kind of support is included? Can I request a feature? Will you update the script? Can I get a discount? Can I get a refund? How can I see which version I have? If you log in as the admin, you will see the version number on the dashboard. How can I see what is the latest version? The changelog will show the latest version and all changes. How can I change the content? See content customization. How can I add or modify languages? See translation customization. What kind of support is included? We are happy to help you with technical questions about features. If things don't work as expected, or if you run into any bugs, please let us know and we will try to solve the issue as soon as possible. Support does NOT include the following: We cannot provide general webhosting and\/or general PHP support. We cannot provide general Laravel support. We cannot help with issues from your own customization. We cannot provide customizations that extended default servicesfeatures. What you see in the demo is what comes with your purchase. We cannot provide how-to advice on if servicesis capable of doing what you want\/need. Read documentation and try the demo to determine if it will suit your needs. We cannot provide fixes that are unique to your web hosting or server environment. If your hosting or server environment is different than what is listed in requirements section, you'll need to determine if it will work before purchasing. We try for fast response times but as described on our support tab, response time may be up to 2 business days. Too many issue\/feature questions that do not fall under support will slow down all response times. Please investigate for yourself thoroughly before contacting us. Other notes and considerations: If you found a bug feel free to report but first check if there in new version available. Before asking questions, please search the comments area. Questions may have already been answered. Before asking questions, please check the documentation. Before asking questions, please check the FAQ's. If you are experiencing installation problem please open a support ticket. You can be assisted while your server meets the servicesrequirements. Please do not ask for a free licence. We appreciate help but will not compensate for it. Please dont ask for support on the comments sections. Usualy you will get the answer &quot;Please open a support ticket&quot;. If your support is expired, before asking questions consider renewing it. You cannot get a refund once the item has been downloaded under any circumstances. Can I request a feature? Almost anything is technically possible to implement. The question is whether we want to support it and whether it increases sales sufficiently to justify the support and the time it takes. Before you ask, &quot;Are there plans for Function X?&quot;, &quot;Are you going to add Y?&quot;, understand that we run a business. Selling a script in a niche market like this doesn't make a profit. A lot of time and money has been invested in making a script like this and we're not even close to a break-even point. We don't expect to ever get back the money we invested with selling scripts. We earn our money with custom projects. Will you update the script? We strive to keep the script bug-free, regularly updated and provide support where necessary. To what extent this is possible, ultimately depends on sales. Can I get a discount? We believe that the price should be fair. It's already as low as possible, so discount is not meaningful. Can I get a refund? You cannot get a refund once the item has been downloaded under any circumstances. There is an online demo where you can test all features, and you can ask questions before making the purchase.","tags":"","url":"Frequently_Asked_Questions.html"}]}